from random import choice

print("Добро пожаловать в нашу коллекцию мини-игр!")
print("У нас есть несколько увлекательных игр, которые помогут тебе развлечься и провести время с пользой")
print(" В зависимости от твоих предпочтений, у нас найдется что-то для тебя!")
print("Выбирай любую игру из списка ниже и наслаждайся игровым процессом:")
print("1. Виселица: Угадай загаданное слово, угадывая по одной букве за раз, но будь осторожен - у тебя ограниченное количество попыток.")

rezim_game = input()

if rezim_game == "1":
    hangman = (
    """
     ------
     |    |
     |
     |
     |
     |
     |
    ----------
    """,
    """
     ------
     |    |
     |    O
     |
     |
     |
     |
    ----------
    """,
    """
     ------
     |    |
     |    O
     |    |
     | 
     |   
     |    
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|
     |   
     |   
     |   
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|\\
     |   
     |   
     |     
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|\\
     |   /
     |   
     |    
    ----------
    """,
    """
     ------
     |    |
     |    O
     |   /|\\
     |   / \\
     |   
     |   
    ----------
    """)

    count_wrong = len(hangman) - 1 #макс количество ошибок
    words = ("вес","май", "арбуз","слово", "математика","любовь", "кирпич","стул", "ананас","кофта", "майка","бар", "компьютер","мышь", "пенал","тетрадь", "ручка","телефон", "серёжки","пульт", "еда","мафия", "каталог","библиотека", "мужчина", "игра", "программирование")

    word = choice(words)  # выбираем слово
    count_alf = "_" * len(word)  # Количество букв
    wrong = 0  # Количество неверных ответов
    user_alf = []  # Буквы уже угаданы
    
    while wrong < count_wrong and count_alf != word:
        print(hangman[wrong])  # Вывод висельника по индексу
        print("\nИспользованные буквы:\n", user_alf)
        print("\nСлово, которое нужно найти:\n", count_alf)

        alf = input("\n\nВведите свое предположение с маленькой буквы: ")  
        while alf in user_alf:
            print("Вы уже вводили букву", alf)  # Если буква уже вводилась ранее, то выводим 
            alf = input("Введите свое предположение с маленькой буквы: ")  
        
        user_alf.append(alf)
        
        if alf in word:  # Если введённая буква есть в загаданном слове, то выводим соответствующее сообщение
            print("\nДа!", alf, "есть в слове!")
            new = ""
            for i in range(len(word)):  # В цикле добавляем найденную букву в нужное место
                if alf == word[i]:
                    new += alf
                else:
                    new += count_alf[i]
            count_alf = new
        else:
            print("\nИзвините, буквы \"" + alf + "\" нет в слове.")  # Если буквы нет, то выводим соответствующее сообщение
            wrong += 1

    if wrong == count_wrong: 
        print(hangman[wrong])
        print("\nТебя повесили!")
    else:  
        print("\nВы угадали слово!")
    print("\nЗагаданное слово было \"" + word + '\"')
